package com.jone.app.utils;

/**
 * Created by jone_admin on 14-2-15.
 */
public class TimeDateUtil {

    //天干
    final static String[] TianGans = new String[] { "甲", "乙", "丙", "丁", "戊", "己",
            "庚", "辛", "壬", "癸" };

    //地支
    final static String[] DiZhis = new String[] { "子", "丑", "寅", "卯", "辰", "巳",
            "午", "未", "申", "酉", "戌", "亥" };

    //十二生肖
    final static String[] ChineseZodiacs = new String[] { "鼠", "牛", "虎", "兔", "龙",
            "蛇", "马", "羊", "猴", "鸡", "狗", "猪" };

    //二十四节气
    final static String[] SolarTerms = new String[] { "小寒", "大寒", "立春", "雨水",
            "惊蛰", "春分", "清明", "谷雨", "立夏", "小满", "芒种", "夏至", "小暑", "大暑", "立秋",
            "处暑", "白露", "秋分", "寒露", "霜降", "立冬", "小雪", "大雪", "冬至" };

    //农历月份
    final static String ChineseMonthNumbers[] = { "正", "二", "三", "四", "五", "六",
            "七", "八", "九", "十", "冬", "腊" };

    //公历节日
    final static String[] sFtv = new String[] { "0101*元旦", "0214 情人节",
            "0308 妇女节", "0312 植树节", "0314 国际警察日", "0315 消费者权益日", "0323 世界气象日",
            "0401 愚人节", "0407 世界卫生日", "0501*劳动节", "0504 青年节", "0508 红十字日",
            "0512 护士节", "0515 国际家庭日", "0517 世界电信日", "0519 全国助残日", "0531 世界无烟日",
            "0601 儿童节", "0605 世界环境日", "0606 全国爱眼日", "0623 奥林匹克日", "0625 全国土地日",
            "0626 反毒品日", "0701 建党节", "0707 抗战纪念日", "0711 世界人口日", "0801 建军节",
            "0908 国际扫盲日", "0909 毛泽东逝世纪念", "0910 教师节", "0917 国际和平日",
            "0920 国际爱牙日", "0922 国际聋人节", "0927 世界旅游日", "0928 孔子诞辰", "1001*国庆节",
            "1004 世界动物日", "1006 老人节", "1007 国际住房日", "1009 世界邮政日", "1015 国际盲人节",
            "1016 世界粮食日", "1024 联合国日", "1031 万圣节", "1108 中国记者日", "1109 消防宣传日",
            "1112 孙中山诞辰", "1114 世界糖尿病日", "1117 国际大学生节", "1201 世界艾滋病日",
            "1203 世界残疾人日", "1209 世界足球日", "1220 澳门回归", "1225 圣诞节", "1226 毛泽东诞辰" };
}
